import {Link} from "react-router-dom";

// Компонент Menu містить навігаційне меню сайту та дозволяє користувачу
// переходити між доступними сторінками за допомогою навігаційних посилань
const Menu = () => {

    return (
        // Контейнер навігаційного меню
        <div>
            {/* Список навігаційних посилань. */}
            <ul>
                <li>
                    {/* Посилання для переходу на сторінку користувачів. */}
                    <Link to={'users'}>users</Link>
                </li>
                <li>
                    {/* Посилання для переходу на сторінку постів. */}
                    <Link to={'posts'}>posts</Link>
                </li>
                <li>
                    {/* Посилання для переходу на сторінку коментарів. */}
                    <Link to={'comments'}>comments</Link>
                </li>
                <li>
                    {/* Посилання для переходу на сторінку комплексного відображення даних. */}
                    <Link to={'complex'}>complex</Link>
                </li>
            </ul>
        </div>
    );
};

// Експортуємо компонент для використання в інших частинах застосунку
export default Menu;