import {Outlet} from "react-router-dom";
import Menu from "../menu/Menu.tsx";

// Компонент MainLayout відображає меню та вміст поточного дочірнього маршруту
const MainLayout = () => {
    // Повертаємо JSX-розмітку головного макета
    return (
        // Контейнер макета, що об'єднує меню та вміст сторінки
        <div>
            {/* Відображає меню навігації для переходу між сторінками сайту*/}
            <Menu/>
            {/*Виводить дочірні маршрути*/}
            <Outlet/>
        </div>
    );
};

// Експортуємо макет для використання в конфігурації маршрутизації
export default MainLayout;